lightelf76/FNET/fnet_stack/port/cpu/lm3s/lm3s_regs.h
/*
 * ============================================================================
 * ----------- Processor and Core Peripheral Section --------------------------
 * ============================================================================
 */

/* Configuration of the Cortex-M3 Processor and Core Peripherals */
#define __MPU_PRESENT           1   /*!< MPU present or not                  */
#define __NVIC_PRIO_BITS        3   /*!< Number of Bits used for Prio Levels */
#define __Vendor_SysTickConfig  0   /*!< 1 if different SysTick config used  */

#include "core_cm3.h"          /* Cortex-M3 processor and core periphs  */

/**
 * @brief  Setup the initial configuration of the microcontroller
 * @param  none
 * @return none
 *
 * Initialize the system clocking according to the user configuration.
 */
//extern void SystemInit (void);


/*****************************************************************************/
/*                Device Specific Peripheral registers structures            */
/*****************************************************************************/

/*----------       System Controller (SYSCTL)                     -----------*/
// <g> System Controller (SYSCTL)
typedef struct
{
    __I  uint32_t DID0;             // Device identification register 0
    __I  uint32_t DID1;             // Device identification register 1
    __I  uint32_t DC0;              // Device capabilities register 0
         uint8_t  RESERVED1[4];
    __I  uint32_t DC1;              // Device capabilities register 1
    __I  uint32_t DC2;              // Device capabilities register 2
    __I  uint32_t DC3;              // Device capabilities register 3
    __I  uint32_t DC4;              // Device capabilities register 4
    __I  uint32_t DC5;              // Device capabilities register 5
    __I  uint32_t DC6;              // Device capabilities register 6
    __I  uint32_t DC7;              // Device capabilities register 7
    __I  uint32_t DC8;              // Device capabilities register 8
    __IO uint32_t PBORCTL;          // POR/BOR reset control register
    __IO uint32_t LDOPCTL;          // LDO power control register
         uint8_t  RESERVED2[8];
    __IO uint32_t SRCR0;            // Software reset control reg 0
    __IO uint32_t SRCR1;            // Software reset control reg 1
    __IO uint32_t SRCR2;            // Software reset control reg 2
         uint8_t  RESERVED3[4];
    __I  uint32_t RIS;              // Raw interrupt status register
    __IO uint32_t IMC;              // Interrupt mask/control register
    __IO uint32_t MISC;             // Interrupt status register
    __IO uint32_t RESC;             // Reset cause register
    __IO uint32_t RCC;              // Run-mode clock config register
    __I  uint32_t PLLCFG;           // PLL configuration register
         uint8_t  RESERVED4[4];
    __IO uint32_t GPIOHBCTL;        // GPIO High-Performance Bus Control
#define GPIOHSCTL GPIOHBCTL         // [__IO] GPIO High Speed Control
    __IO uint32_t RCC2;             // Run-mode clock config register 2
         uint8_t  RESERVED6[8];
    __IO uint32_t MOSCCTL;          // Main Oscillator Control
         uint8_t  RESERVED7[128];
    __IO uint32_t RCGC0;            // Run-mode clock gating register 0
    __IO uint32_t RCGC1;            // Run-mode clock gating register 1
    __IO uint32_t RCGC2;            // Run-mode clock gating register 2
         uint8_t  RESERVED8[4];
    __IO uint32_t SCGC0;            // Sleep-mode clock gating reg 0
    __IO uint32_t SCGC1;            // Sleep-mode clock gating reg 1
    __IO uint32_t SCGC2;            // Sleep-mode clock gating reg 2
         uint8_t  RESERVED9[4];
    __IO uint32_t DCGC0;            // Deep Sleep-mode clock gate reg 0
    __IO uint32_t DCGC1;            // Deep Sleep-mode clock gate reg 1
    __IO uint32_t DCGC2;            // Deep Sleep-mode clock gate reg 2
         uint8_t  RESERVED10[24];
    __IO uint32_t DSLPCLKCFG;       // Deep Sleep-mode clock config reg
         uint8_t  RESERVED11[8];
    __IO uint32_t PIOSCCAL;         // Precision Internal Oscillator Calibration
    __I  uint32_t PIOSCSTAT;        // Precision Internal Oscillator Statistics
         uint8_t  RESERVED13[8];
    __IO uint32_t LDOARST;          // LDO reset control register
         uint8_t  RESERVED14[12];
    __IO uint32_t I2SMCLKCFG;       // I2S MCLK Configuration
         uint8_t  RESERVED15[28];
    __I  uint32_t DC9;              // Device capabilities register 9
         uint8_t  RESERVED16[12];
    __I  uint32_t NVMSTAT;          // Non-Volitile Memory Information
} SYSCTL_Type;
// </g>

/*----------       General Purpose Input/Output (GPIO)            -----------*/
// <g> General Purpose Input/Output (GPIO)
typedef struct
{
    __IO uint32_t DATA_Bits[255];   // Bit specific data registers
    __IO uint32_t DATA;             // Data register
    __IO uint32_t DIR;              // Data direction register
    __IO uint32_t IS;               // Interrupt sense register
    __IO uint32_t IBE;              // Interrupt both edges register
    __IO uint32_t IEV;              // Interrupt event register
    __IO uint32_t IM;               // Interrupt mask register
    __I  uint32_t RIS;              // Raw interrupt status register
    __I  uint32_t MIS;              // Masked interrupt status reg
    __O  uint32_t ICR;              // Interrupt clear register
    __IO uint32_t AFSEL;            // Mode control select register
         uint8_t  RESERVED1[220];
    __IO uint32_t DR2R;             // 2ma drive select register
    __IO uint32_t DR4R;             // 4ma drive select register
    __IO uint32_t DR8R;             // 8ma drive select register
    __IO uint32_t ODR;              // Open drain select register
    __IO uint32_t PUR;              // Pull up select register
    __IO uint32_t PDR;              // Pull down select register
    __IO uint32_t SLR;              // Slew rate control enable reg
    __IO uint32_t DEN;              // Digital input enable register
    __IO uint32_t LOCK;             // Lock register
    __IO  uint32_t CR;               // Commit register
    __IO uint32_t AMSEL;            // GPIO Analog Mode Select
    __IO uint32_t PCTL;             // GPIO Port Control
} GPIO_Type;
// </g>

/*----------       General Purpose Timer (TIMER)                  -----------*/
// <g> General Purpose Timer (TIMER)
typedef struct
{
    __IO uint32_t CFG;              // Configuration register
    __IO uint32_t TAMR;             // TimerA mode register
    __IO uint32_t TBMR;             // TimerB mode register
    __IO uint32_t CTL;              // Control register
         uint8_t  RESERVED0[8];
    __IO uint32_t IMR;              // Interrupt mask register
    __I  uint32_t RIS;              // Interrupt status register
    __I  uint32_t MIS;              // Masked interrupt status reg
    __O  uint32_t ICR;              // Interrupt clear register
    __IO uint32_t TAILR;            // TimerA interval load register
    __IO uint32_t TBILR;            // TimerB interval load register
    __IO uint32_t TAMATCHR;         // TimerA match register
    __IO uint32_t TBMATCHR;         // TimerB match register
    __IO uint32_t TAPR;             // TimerA prescale register
    __IO uint32_t TBPR;             // TimerB prescale register
    __IO uint32_t TAPMR;            // TimerA prescale match register
    __IO uint32_t TBPMR;            // TimerB prescale match register
    __I  uint32_t TAR;              // TimerA register
    __I  uint32_t TBR;              // TimerB register
    __I  uint32_t TAV;              // GPTM Timer A Value
    __I  uint32_t TBV;              // GPTM Timer B Value
} TIMER_Type;
// </g>

