lightelf76/FNET/fnet_stack/port/cpu/lm3s/lm3s_regs.h
/*----------       Analog to Digital Converter (ADC)              -----------*/
// <g> Analog to Digital Converter (ADC)
typedef struct
{
    __IO uint32_t ACTSS;            // Active sample register
    __I  uint32_t RIS;              // Raw interrupt status register
    __IO uint32_t IM;               // Interrupt mask register
    __IO uint32_t ISC;              // Interrupt status/clear register
    __IO uint32_t OSTAT;            // Overflow status register
    __IO uint32_t EMUX;             // Event multiplexer select reg
    __IO uint32_t USTAT;            // Underflow status register
         uint8_t  RESERVED0[4];
    __IO uint32_t SSPRI;            // Channel priority register
         uint8_t  RESERVED1[4];
    __O  uint32_t PSSI;             // Processor sample initiate reg
         uint8_t  RESERVED2[4];
    __IO uint32_t SAC;              // Sample Averaging Control reg
    __IO uint32_t DCISC;            // ADC Digital Comparator Interrupt Status
                                    // and Clear
    __IO uint32_t CTL;              // ADC Control
         uint8_t  RESERVED3[4];
    __IO uint32_t SSMUX0;           // Multiplexer select 0 register
    __IO uint32_t SSCTL0;           // Sample sequence control 0 reg
    __I  uint32_t SSFIFO0;          // Result FIFO 0 register
    __I  uint32_t SSFSTAT0;         // FIFO 0 status register
    __IO uint32_t SSOP0;            // ADC Sample Sequence 0 Operation
    __IO uint32_t SSDC0;            // ADC Sample Sequence 0 Digital Comparator
                                    // Select
         uint8_t  RESERVED4[8];
    __IO uint32_t SSMUX1;           // Multiplexer select 1 register
    __IO uint32_t SSCTL1;           // Sample sequence control 1 reg
    __I  uint32_t SSFIFO1;          // Result FIFO 1 register
    __I  uint32_t SSFSTAT1;         // FIFO 1 status register
    __IO uint32_t SSOP1;            // ADC Sample Sequence 1 Operation
    __IO uint32_t SSDC1;            // ADC Sample Sequence 1 Digital Comparator
                                    // Select
         uint8_t  RESERVED5[8];
    __IO uint32_t SSMUX2;           // Multiplexer select 2 register
    __IO uint32_t SSCTL2;           // Sample sequence control 2 reg
    __I  uint32_t SSFIFO2;          // Result FIFO 2 register
    __I  uint32_t SSFSTAT2;         // FIFO 2 status register
    __IO uint32_t SSOP2;            // ADC Sample Sequence 2 Operation
    __IO uint32_t SSDC2;            // ADC Sample Sequence 2 Digital Comparator
                                    // Select
         uint8_t  RESERVED6[8];
    __IO uint32_t SSMUX3;           // Multiplexer select 3 register
    __IO uint32_t SSCTL3;           // Sample sequence control 3 reg
    __I  uint32_t SSFIFO3;          // Result FIFO 3 register
    __I  uint32_t SSFSTAT3;         // FIFO 3 status register
    __IO uint32_t SSOP3;            // ADC Sample Sequence 3 Operation
    __IO uint32_t SSDC3;            // ADC Sample Sequence 3 Digital Comparator
                                    // Select
         uint8_t  RESERVED7[72];
    __IO uint32_t TMLB;             // Test mode loopback register
         uint8_t  RESERVED8[3068];
    __IO uint32_t DCRIC;            // ADC Digital Comparator Reset Initial
                                    // Conditions
         uint8_t  RESERVED9[252];
    __IO uint32_t DCCTL0;           // ADC Digital Comparator Control 0
    __IO uint32_t DCCTL1;           // ADC Digital Comparator Control 1
    __IO uint32_t DCCTL2;           // ADC Digital Comparator Control 2
    __IO uint32_t DCCTL3;           // ADC Digital Comparator Control 3
    __IO uint32_t DCCTL4;           // ADC Digital Comparator Control 4
    __IO uint32_t DCCTL5;           // ADC Digital Comparator Control 5
    __IO uint32_t DCCTL6;           // ADC Digital Comparator Control 6
    __IO uint32_t DCCTL7;           // ADC Digital Comparator Control 7
         uint8_t  RESERVED10[32];
    __IO uint32_t DCCMP0;           // ADC Digital Comparator Range 0
    __IO uint32_t DCCMP1;           // ADC Digital Comparator Range 1
    __IO uint32_t DCCMP2;           // ADC Digital Comparator Range 2
    __IO uint32_t DCCMP3;           // ADC Digital Comparator Range 3
    __IO uint32_t DCCMP4;           // ADC Digital Comparator Range 4
    __IO uint32_t DCCMP5;           // ADC Digital Comparator Range 5
    __IO uint32_t DCCMP6;           // ADC Digital Comparator Range 6
    __IO uint32_t DCCMP7;           // ADC Digital Comparator Range 7
} ADC_Type;
// </g>

/*----------       Controller Area Network (CAN)                  -----------*/
// <g> Controller Area Network (CAN)
typedef struct
{
    __IO uint32_t CTL;              // Control register
    __IO uint32_t STS;              // Status register
    __I  uint32_t ERR;              // Error register
    __IO uint32_t BIT;              // Bit Timing register
    __I  uint32_t INT;              // Interrupt register
    __IO uint32_t TST;              // Test register
    __IO uint32_t BRPE;             // Baud Rate Prescaler register
         uint8_t  RESERVED0[4];
    __IO uint32_t IF1CRQ;           // Interface 1 Command Request reg
    __IO uint32_t IF1CMSK;          // Interface 1 Command Mask reg
    __IO uint32_t IF1MSK1;          // Interface 1 Mask 1 register
    __IO uint32_t IF1MSK2;          // Interface 1 Mask 2 register
    __IO uint32_t IF1ARB1;          // Interface 1 Arbitration 1 reg
    __IO uint32_t IF1ARB2;          // Interface 1 Arbitration 2 reg
    __IO uint32_t IF1MCTL;          // Interface 1 Message Control reg
    __IO uint32_t IF1DA1;           // Interface 1 DataA 1 register
    __IO uint32_t IF1DA2;           // Interface 1 DataA 2 register
    __IO uint32_t IF1DB1;           // Interface 1 DataB 1 register
    __IO uint32_t IF1DB2;           // Interface 1 DataB 2 register
         uint8_t  RESERVED1[52];
    __IO uint32_t IF2CRQ;           // Interface 2 Command Request reg
    __IO uint32_t IF2CMSK;          // Interface 2 Command Mask reg
    __IO uint32_t IF2MSK1;          // Interface 2 Mask 1 register
    __IO uint32_t IF2MSK2;          // Interface 2 Mask 2 register
    __IO uint32_t IF2ARB1;          // Interface 2 Arbitration 1 reg
    __IO uint32_t IF2ARB2;          // Interface 2 Arbitration 2 reg
    __IO uint32_t IF2MCTL;          // Interface 2 Message Control reg
    __IO uint32_t IF2DA1;           // Interface 2 DataA 1 register
    __IO uint32_t IF2DA2;           // Interface 2 DataA 2 register
    __IO uint32_t IF2DB1;           // Interface 2 DataB 1 register
    __IO uint32_t IF2DB2;           // Interface 2 DataB 2 register
         uint8_t  RESERVED2[84];
    __I  uint32_t TXRQ1;            // Transmission Request 1 register
    __I  uint32_t TXRQ2;            // Transmission Request 2 register
         uint8_t  RESERVED3[24];
    __I  uint32_t NWDA1;            // New Data 1 register
    __I  uint32_t NWDA2;            // New Data 2 register
         uint8_t  RESERVED4[24];
    __I  uint32_t MSG1INT;          // CAN Message 1 Interrupt Pending
    __I  uint32_t MSG2INT;          // CAN Message 2 Interrupt Pending
         uint8_t  RESERVED5[24];
    __I  uint32_t MSG1VAL;          // CAN Message 1 Valid
    __I  uint32_t MSG2VAL;          // CAN Message 2 Valid
} CAN_Type;
// </g>

/*----------       Analog Comparators (COMP)                      -----------*/
// <g> Analog Comparators (COMP)
typedef struct
{
    __IO uint32_t ACMIS;            // Analog Comparator Masked
                                    // Interrupt Status
    __I  uint32_t ACRIS;            // Analog Comparator Raw Interrupt Status
    __IO uint32_t ACINTEN;          // Analog Comparator Interrupt Enable
         uint8_t  RESERVED0[4];
    __IO uint32_t ACREFCTL;         // Analog Comparator Reference Voltage
                                    // Control
         uint8_t  RESERVED1[12];
    __I  uint32_t ACSTAT0;          // Comp0 status register
    __IO uint32_t ACCTL0;           // Comp0 control register
         uint8_t  RESERVED2[24];
    __I  uint32_t ACSTAT1;          // Comp1 status register
    __IO uint32_t ACCTL1;           // Comp1 control register
         uint8_t  RESERVED3[24];
    __I  uint32_t ACSTAT2;          // Comp2 status register
    __IO uint32_t ACCTL2;           // Comp2 control register
} COMP_Type;
// </g>

/*----------       External Peripheral Interface (EPI)            -----------*/
// <g> External Peripheral Interface (EPI)
typedef struct
{
    __IO uint32_t CFG;              // EPI Configuration
    __IO uint32_t BAUD;             // EPI Main Baud Rate
         uint8_t  RESERVED0[8];
    __IO uint32_t GPCFG;            // EPI General Purpose Configuration
#define HB16CFG   GPCFG             // EPI Host-Bus 16 Configuration
#define HB8CFG    GPCFG             // EPI Host-Bus 8 Mode Configuration
#define SDRAMCFG  GPCFG             // EPI SDRAM Mode Configuration
    __IO uint32_t GPCFG2;           // EPI General-Purpose Configuration 2
#define HB16CFG2  GPCFG2            // EPI Host-Bus 16 Configuration 2
#define HB8CFG2   GPCFG2            // EPI Host-Bus 8 Configuration 2
         uint8_t  RESERVED7[4];
    __IO uint32_t ADDRMAP;          // EPI Address Map
    __IO uint32_t RSIZE0;           // EPI Read Size 0
    __IO uint32_t RADDR0;           // EPI Read Address 0
    __IO uint32_t RPSTD0;           // EPI Non-Blocking Read Data 0
         uint8_t  RESERVED8[4];
    __IO uint32_t RSIZE1;           // EPI Read Size 1
    __IO uint32_t RADDR1;           // EPI Read Address 1
    __IO uint32_t RPSTD1;           // EPI Non-Blocking Read Data 1
         uint8_t  RESERVED9[36];
    __I  uint32_t STAT;             // EPI Status
         uint8_t  RESERVED10[8];
    __I  uint32_t RFIFOCNT;         // EPI Read FIFO Count
    __I  uint32_t READFIFO;         // EPI Read FIFO
    __I  uint32_t READFIFO1;        // EPI Read FIFO Alias 1
    __I  uint32_t READFIFO2;        // EPI Read FIFO Alias 2
    __I  uint32_t READFIFO3;        // EPI Read FIFO Alias 3
    __I  uint32_t READFIFO4;        // EPI Read FIFO Alias 4
    __I  uint32_t READFIFO5;        // EPI Read FIFO Alias 5
    __I  uint32_t READFIFO6;        // EPI Read FIFO Alias 6
    __I  uint32_t READFIFO7;        // EPI Read FIFO Alias 7
         uint8_t  RESERVED11[368];
    __IO uint32_t FIFOLVL;          // EPI FIFO Level Selects
    __I  uint32_t WFIFOCNT;         // EPI Write FIFO Count
         uint8_t  RESERVED12[8];
    __IO uint32_t IM;               // EPI Interrupt Mask
    __I  uint32_t RIS;              // EPI Raw Interrupt Status
    __I  uint32_t MIS;              // EPI Masked Interrupt Status
    __IO uint32_t EISC;             // EPI Error Interrupt Status and Clear
} EPI_Type;
// </g>

