lightelf76/FNET/fnet_stack/port/cpu/lm3s/lm3s_regs.h
/*----------       DMA Channel Control Structure (UDMA_CTRL)      -----------*/
// <g> DMA Channel Control Structure (UDMA_CTRL)
typedef struct
{
    __IO uint32_t SRCENDP;          // DMA Channel Source Address End Pointer
    __IO uint32_t DSTENDP;          // DMA Channel Destination Address End
                                    // Pointer
    __IO uint32_t CHCTL;            // DMA Channel Control Word
} UDMA_CTRL_Type;
// </g>

/*----------       Universal Serial Bus Controller (USB)          -----------*/
// <g> Universal Serial Bus Controller (USB)
typedef struct
{
    __IO uint8_t  FADDR;            // USB Device Functional Address
    __IO uint8_t  POWER;            // USB Power
    __I  uint16_t TXIS;             // USB Transmit Interrupt Status
    __I  uint16_t RXIS;             // USB Receive Interrupt Status
    __IO uint16_t TXIE;             // USB Transmit Interrupt Enable
    __IO uint16_t RXIE;             // USB Receive Interrupt Enable
    __I  uint8_t  IS;               // USB General Interrupt Status
    __IO uint8_t  IE;               // USB Interrupt Enable
    __I  uint16_t FRAME;            // USB Frame Value
    __IO uint8_t  EPIDX;            // USB Endpoint Index
    __IO uint8_t  TEST;             // USB Test Mode
         uint8_t  RESERVED0[16];
    __IO uint32_t FIFO0;            // USB FIFO Endpoint 0
    __IO uint32_t FIFO1;            // USB FIFO Endpoint 1
    __IO uint32_t FIFO2;            // USB FIFO Endpoint 2
    __IO uint32_t FIFO3;            // USB FIFO Endpoint 3
    __IO uint32_t FIFO4;            // USB FIFO Endpoint 4
    __IO uint32_t FIFO5;            // USB FIFO Endpoint 5
    __IO uint32_t FIFO6;            // USB FIFO Endpoint 6
    __IO uint32_t FIFO7;            // USB FIFO Endpoint 7
    __IO uint32_t FIFO8;            // USB FIFO Endpoint 8
    __IO uint32_t FIFO9;            // USB FIFO Endpoint 9
    __IO uint32_t FIFO10;           // USB FIFO Endpoint 10
    __IO uint32_t FIFO11;           // USB FIFO Endpoint 11
    __IO uint32_t FIFO12;           // USB FIFO Endpoint 12
    __IO uint32_t FIFO13;           // USB FIFO Endpoint 13
    __IO uint32_t FIFO14;           // USB FIFO Endpoint 14
    __IO uint32_t FIFO15;           // USB FIFO Endpoint 15
    __IO uint8_t  DEVCTL;           // USB Device Control
         uint8_t  RESERVED1[1];
    __IO uint8_t  TXFIFOSZ;         // USB Transmit Dynamic FIFO Sizing
    __IO uint8_t  RXFIFOSZ;         // USB Receive Dynamic FIFO Sizing
    __IO uint16_t TXFIFOADD;        // USB Transmit FIFO Start Address
    __IO uint16_t RXFIFOADD;        // USB Receive FIFO Start Address
         uint8_t  RESERVED2[18];
    __IO uint8_t  CONTIM;           // USB Connect Timing
    __IO uint8_t  VPLEN;            // USB OTG VBus Pulse Timing
         uint8_t  RESERVED3[1];
    __IO uint8_t  FSEOF;            // USB Full-Speed Last Transaction to End
                                    // of Frame Timing
    __IO uint8_t  LSEOF;            // USB Low-Speed Last Transaction to End of
                                    // Frame Timing
         uint8_t  RESERVED4[1];
    __IO uint8_t  TXFUNCADDR0;      // USB Transmit Functional Address
                                    // Endpoint 0
         uint8_t  RESERVED5[1];
    __IO uint8_t  TXHUBADDR0;       // USB Transmit Hub Address Endpoint 0
    __IO uint8_t  TXHUBPORT0;       // USB Transmit Hub Port Endpoint 0
         uint8_t  RESERVED6[4];
    __IO uint8_t  TXFUNCADDR1;      // USB Transmit Functional Address
                                    // Endpoint 1
         uint8_t  RESERVED7[1];
    __IO uint8_t  TXHUBADDR1;       // USB Transmit Hub Address Endpoint 1
    __IO uint8_t  TXHUBPORT1;       // USB Transmit Hub Port Endpoint 1
    __IO uint8_t  RXFUNCADDR1;      // USB Receive Functional Address
                                    // Endpoint 1
         uint8_t  RESERVED8[1];
    __IO uint8_t  RXHUBADDR1;       // USB Receive Hub Address Endpoint 1
    __IO uint8_t  RXHUBPORT1;       // USB Receive Hub Port Endpoint 1
    __IO uint8_t  TXFUNCADDR2;      // USB Transmit Functional Address
                                    // Endpoint 2
         uint8_t  RESERVED9[1];
    __IO uint8_t  TXHUBADDR2;       // USB Transmit Hub Address Endpoint 2
    __IO uint8_t  TXHUBPORT2;       // USB Transmit Hub Port Endpoint 2
    __IO uint8_t  RXFUNCADDR2;      // USB Receive Functional Address
                                    // Endpoint 2
         uint8_t  RESERVED10[1];
    __IO uint8_t  RXHUBADDR2;       // USB Receive Hub Address Endpoint 2
    __IO uint8_t  RXHUBPORT2;       // USB Receive Hub Port Endpoint 2
    __IO uint8_t  TXFUNCADDR3;      // USB Transmit Functional Address
                                    // Endpoint 3
         uint8_t  RESERVED11[1];
    __IO uint8_t  TXHUBADDR3;       // USB Transmit Hub Address Endpoint 3
    __IO uint8_t  TXHUBPORT3;       // USB Transmit Hub Port Endpoint 3
    __IO uint8_t  RXFUNCADDR3;      // USB Receive Functional Address
                                    // Endpoint 3
         uint8_t  RESERVED12[1];
    __IO uint8_t  RXHUBADDR3;       // USB Receive Hub Address Endpoint 3
    __IO uint8_t  RXHUBPORT3;       // USB Receive Hub Port Endpoint 3
    __IO uint8_t  TXFUNCADDR4;      // USB Transmit Functional Address
                                    // Endpoint 4
         uint8_t  RESERVED13[1];
    __IO uint8_t  TXHUBADDR4;       // USB Transmit Hub Address Endpoint 4
    __IO uint8_t  TXHUBPORT4;       // USB Transmit Hub Port Endpoint 4
    __IO uint8_t  RXFUNCADDR4;      // USB Receive Functional Address
                                    // Endpoint 4
         uint8_t  RESERVED14[1];
    __IO uint8_t  RXHUBADDR4;       // USB Receive Hub Address Endpoint 4
    __IO uint8_t  RXHUBPORT4;       // USB Receive Hub Port Endpoint 4
    __IO uint8_t  TXFUNCADDR5;      // USB Transmit Functional Address
                                    // Endpoint 5
         uint8_t  RESERVED15[1];
    __IO uint8_t  TXHUBADDR5;       // USB Transmit Hub Address Endpoint 5
    __IO uint8_t  TXHUBPORT5;       // USB Transmit Hub Port Endpoint 5
    __IO uint8_t  RXFUNCADDR5;      // USB Receive Functional Address
                                    // Endpoint 5
         uint8_t  RESERVED16[1];
    __IO uint8_t  RXHUBADDR5;       // USB Receive Hub Address Endpoint 5
    __IO uint8_t  RXHUBPORT5;       // USB Receive Hub Port Endpoint 5
    __IO uint8_t  TXFUNCADDR6;      // USB Transmit Functional Address
                                    // Endpoint 6
         uint8_t  RESERVED17[1];
    __IO uint8_t  TXHUBADDR6;       // USB Transmit Hub Address Endpoint 6
    __IO uint8_t  TXHUBPORT6;       // USB Transmit Hub Port Endpoint 6
    __IO uint8_t  RXFUNCADDR6;      // USB Receive Functional Address
                                    // Endpoint 6
         uint8_t  RESERVED18[1];
    __IO uint8_t  RXHUBADDR6;       // USB Receive Hub Address Endpoint 6
    __IO uint8_t  RXHUBPORT6;       // USB Receive Hub Port Endpoint 6
    __IO uint8_t  TXFUNCADDR7;      // USB Transmit Functional Address
                                    // Endpoint 7
         uint8_t  RESERVED19[1];
    __IO uint8_t  TXHUBADDR7;       // USB Transmit Hub Address Endpoint 7
    __IO uint8_t  TXHUBPORT7;       // USB Transmit Hub Port Endpoint 7
    __IO uint8_t  RXFUNCADDR7;      // USB Receive Functional Address
                                    // Endpoint 7
         uint8_t  RESERVED20[1];
    __IO uint8_t  RXHUBADDR7;       // USB Receive Hub Address Endpoint 7
    __IO uint8_t  RXHUBPORT7;       // USB Receive Hub Port Endpoint 7
    __IO uint8_t  TXFUNCADDR8;      // USB Transmit Functional Address
                                    // Endpoint 8
         uint8_t  RESERVED21[1];
    __IO uint8_t  TXHUBADDR8;       // USB Transmit Hub Address Endpoint 8
    __IO uint8_t  TXHUBPORT8;       // USB Transmit Hub Port Endpoint 8
    __IO uint8_t  RXFUNCADDR8;      // USB Receive Functional Address
                                    // Endpoint 8
         uint8_t  RESERVED22[1];
    __IO uint8_t  RXHUBADDR8;       // USB Receive Hub Address Endpoint 8
    __IO uint8_t  RXHUBPORT8;       // USB Receive Hub Port Endpoint 8
    __IO uint8_t  TXFUNCADDR9;      // USB Transmit Functional Address
                                    // Endpoint 9
         uint8_t  RESERVED23[1];
    __IO uint8_t  TXHUBADDR9;       // USB Transmit Hub Address Endpoint 9
    __IO uint8_t  TXHUBPORT9;       // USB Transmit Hub Port Endpoint 9
    __IO uint8_t  RXFUNCADDR9;      // USB Receive Functional Address
                                    // Endpoint 9
         uint8_t  RESERVED24[1];
    __IO uint8_t  RXHUBADDR9;       // USB Receive Hub Address Endpoint 9
    __IO uint8_t  RXHUBPORT9;       // USB Receive Hub Port Endpoint 9
    __IO uint8_t  TXFUNCADDR10;     // USB Transmit Functional Address
                                    // Endpoint 10
         uint8_t  RESERVED25[1];
    __IO uint8_t  TXHUBADDR10;      // USB Transmit Hub Address Endpoint 10
    __IO uint8_t  TXHUBPORT10;      // USB Transmit Hub Port Endpoint 10
    __IO uint8_t  RXFUNCADDR10;     // USB Receive Functional Address
                                    // Endpoint 10
         uint8_t  RESERVED26[1];
    __IO uint8_t  RXHUBADDR10;      // USB Receive Hub Address Endpoint 10
    __IO uint8_t  RXHUBPORT10;      // USB Receive Hub Port Endpoint 10
    __IO uint8_t  TXFUNCADDR11;     // USB Transmit Functional Address
                                    // Endpoint 11
         uint8_t  RESERVED27[1];
    __IO uint8_t  TXHUBADDR11;      // USB Transmit Hub Address Endpoint 11
    __IO uint8_t  TXHUBPORT11;      // USB Transmit Hub Port Endpoint 11
    __IO uint8_t  RXFUNCADDR11;     // USB Receive Functional Address
                                    // Endpoint 11
         uint8_t  RESERVED28[1];
    __IO uint8_t  RXHUBADDR11;      // USB Receive Hub Address Endpoint 11
    __IO uint8_t  RXHUBPORT11;      // USB Receive Hub Port Endpoint 11
    __IO uint8_t  TXFUNCADDR12;     // USB Transmit Functional Address
                                    // Endpoint 12
         uint8_t  RESERVED29[1];
    __IO uint8_t  TXHUBADDR12;      // USB Transmit Hub Address Endpoint 12
    __IO uint8_t  TXHUBPORT12;      // USB Transmit Hub Port Endpoint 12
    __IO uint8_t  RXFUNCADDR12;     // USB Receive Functional Address
                                    // Endpoint 12
         uint8_t  RESERVED30[1];
    __IO uint8_t  RXHUBADDR12;      // USB Receive Hub Address Endpoint 12
    __IO uint8_t  RXHUBPORT12;      // USB Receive Hub Port Endpoint 12
    __IO uint8_t  TXFUNCADDR13;     // USB Transmit Functional Address
                                    // Endpoint 13
         uint8_t  RESERVED31[1];
    __IO uint8_t  TXHUBADDR13;      // USB Transmit Hub Address Endpoint 13
    __IO uint8_t  TXHUBPORT13;      // USB Transmit Hub Port Endpoint 13
    __IO uint8_t  RXFUNCADDR13;     // USB Receive Functional Address
                                    // Endpoint 13
         uint8_t  RESERVED32[1];
    __IO uint8_t  RXHUBADDR13;      // USB Receive Hub Address Endpoint 13
    __IO uint8_t  RXHUBPORT13;      // USB Receive Hub Port Endpoint 13
    __IO uint8_t  TXFUNCADDR14;     // USB Transmit Functional Address
                                    // Endpoint 14
         uint8_t  RESERVED33[1];
    __IO uint8_t  TXHUBADDR14;      // USB Transmit Hub Address Endpoint 14
    __IO uint8_t  TXHUBPORT14;      // USB Transmit Hub Port Endpoint 14
    __IO uint8_t  RXFUNCADDR14;     // USB Receive Functional Address
                                    // Endpoint 14
         uint8_t  RESERVED34[1];
    __IO uint8_t  RXHUBADDR14;      // USB Receive Hub Address Endpoint 14
    __IO uint8_t  RXHUBPORT14;      // USB Receive Hub Port Endpoint 14
    __IO uint8_t  TXFUNCADDR15;     // USB Transmit Functional Address
                                    // Endpoint 15
         uint8_t  RESERVED35[1];
    __IO uint8_t  TXHUBADDR15;      // USB Transmit Hub Address Endpoint 15
    __IO uint8_t  TXHUBPORT15;      // USB Transmit Hub Port Endpoint 15
    __IO uint8_t  RXFUNCADDR15;     // USB Receive Functional Address
                                    // Endpoint 15
         uint8_t  RESERVED36[1];
    __IO uint8_t  RXHUBADDR15;      // USB Receive Hub Address Endpoint 15
    __IO uint8_t  RXHUBPORT15;      // USB Receive Hub Port Endpoint 15
         uint8_t  RESERVED37[2];
    __O  uint8_t  CSRL0;            // USB Control and Status Endpoint 0 Low
    __O  uint8_t  CSRH0;            // USB Control and Status Endpoint 0 High
         uint8_t  RESERVED38[4];
    __I  uint8_t  COUNT0;           // USB Receive Byte Count Endpoint 0
         uint8_t  RESERVED39[1];
    __IO uint8_t  TYPE0;            // USB Type Endpoint 0
    __IO uint8_t  NAKLMT;           // USB NAK Limit
         uint8_t  RESERVED40[4];
    __IO uint16_t TXMAXP1;          // USB Maximum Transmit Data Endpoint 1
    __IO uint8_t  TXCSRL1;          // USB Transmit Control and Status
                                    // Endpoint 1 Low
    __IO uint8_t  TXCSRH1;          // USB Transmit Control and Status
                                    // Endpoint 1 High
    __IO uint16_t RXMAXP1;          // USB Maximum Receive Data Endpoint 1
    __IO uint8_t  RXCSRL1;          // USB Receive Control and Status
                                    // Endpoint 1 Low
    __IO uint8_t  RXCSRH1;          // USB Receive Control and Status
                                    // Endpoint 1 High
    __I  uint16_t RXCOUNT1;         // USB Receive Byte Count Endpoint 1
    __IO uint8_t  TXTYPE1;          // USB Host Transmit Configure Type
                                    // Endpoint 1
    __IO uint8_t  TXINTERVAL1;      // USB Host Transmit Interval Endpoint 1
    __IO uint8_t  RXTYPE1;          // USB Host Configure Receive Type
                                    // Endpoint 1
    __IO uint8_t  RXINTERVAL1;      // USB Host Receive Polling Interval
                                    // Endpoint 1
         uint8_t  RESERVED41[2];
    __IO uint16_t TXMAXP2;          // USB Maximum Transmit Data Endpoint 2
    __IO uint8_t  TXCSRL2;          // USB Transmit Control and Status
                                    // Endpoint 2 Low
    __IO uint8_t  TXCSRH2;          // USB Transmit Control and Status
                                    // Endpoint 2 High
    __IO uint16_t RXMAXP2;          // USB Maximum Receive Data Endpoint 2
    __IO uint8_t  RXCSRL2;          // USB Receive Control and Status
                                    // Endpoint 2 Low
    __IO uint8_t  RXCSRH2;          // USB Receive Control and Status
                                    // Endpoint 2 High
    __I  uint16_t RXCOUNT2;         // USB Receive Byte Count Endpoint 2
    __IO uint8_t  TXTYPE2;          // USB Host Transmit Configure Type
                                    // Endpoint 2
    __IO uint8_t  TXINTERVAL2;      // USB Host Transmit Interval Endpoint 2
    __IO uint8_t  RXTYPE2;          // USB Host Configure Receive Type
                                    // Endpoint 2
    __IO uint8_t  RXINTERVAL2;      // USB Host Receive Polling Interval
                                    // Endpoint 2
         uint8_t  RESERVED42[2];
    __IO uint16_t TXMAXP3;          // USB Maximum Transmit Data Endpoint 3
    __IO uint8_t  TXCSRL3;          // USB Transmit Control and Status
                                    // Endpoint 3 Low
    __IO uint8_t  TXCSRH3;          // USB Transmit Control and Status
                                    // Endpoint 3 High
    __IO uint16_t RXMAXP3;          // USB Maximum Receive Data Endpoint 3
    __IO uint8_t  RXCSRL3;          // USB Receive Control and Status
                                    // Endpoint 3 Low
    __IO uint8_t  RXCSRH3;          // USB Receive Control and Status
                                    // Endpoint 3 High
    __I  uint16_t RXCOUNT3;         // USB Receive Byte Count Endpoint 3
    __IO uint8_t  TXTYPE3;          // USB Host Transmit Configure Type
                                    // Endpoint 3
    __IO uint8_t  TXINTERVAL3;      // USB Host Transmit Interval Endpoint 3
    __IO uint8_t  RXTYPE3;          // USB Host Configure Receive Type
                                    // Endpoint 3
    __IO uint8_t  RXINTERVAL3;      // USB Host Receive Polling Interval
                                    // Endpoint 3
         uint8_t  RESERVED43[2];
    __IO uint16_t TXMAXP4;          // USB Maximum Transmit Data Endpoint 4
    __IO uint8_t  TXCSRL4;          // USB Transmit Control and Status
                                    // Endpoint 4 Low
    __IO uint8_t  TXCSRH4;          // USB Transmit Control and Status
                                    // Endpoint 4 High
    __IO uint16_t RXMAXP4;          // USB Maximum Receive Data Endpoint 4
    __IO uint8_t  RXCSRL4;          // USB Receive Control and Status
                                    // Endpoint 4 Low
    __IO uint8_t  RXCSRH4;          // USB Receive Control and Status
                                    // Endpoint 4 High
    __I  uint16_t RXCOUNT4;         // USB Receive Byte Count Endpoint 4
    __IO uint8_t  TXTYPE4;          // USB Host Transmit Configure Type
                                    // Endpoint 4
    __IO uint8_t  TXINTERVAL4;      // USB Host Transmit Interval Endpoint 4
    __IO uint8_t  RXTYPE4;          // USB Host Configure Receive Type
                                    // Endpoint 4
    __IO uint8_t  RXINTERVAL4;      // USB Host Receive Polling Interval
                                    // Endpoint 4
         uint8_t  RESERVED44[2];
    __IO uint16_t TXMAXP5;          // USB Maximum Transmit Data Endpoint 5
    __IO uint8_t  TXCSRL5;          // USB Transmit Control and Status
                                    // Endpoint 5 Low
    __IO uint8_t  TXCSRH5;          // USB Transmit Control and Status
                                    // Endpoint 5 High
    __IO uint16_t RXMAXP5;          // USB Maximum Receive Data Endpoint 5
    __IO uint8_t  RXCSRL5;          // USB Receive Control and Status
                                    // Endpoint 5 Low
    __IO uint8_t  RXCSRH5;          // USB Receive Control and Status
                                    // Endpoint 5 High
    __I  uint16_t RXCOUNT5;         // USB Receive Byte Count Endpoint 5
    __IO uint8_t  TXTYPE5;          // USB Host Transmit Configure Type
                                    // Endpoint 5
    __IO uint8_t  TXINTERVAL5;      // USB Host Transmit Interval Endpoint 5
    __IO uint8_t  RXTYPE5;          // USB Host Configure Receive Type
                                    // Endpoint 5
    __IO uint8_t  RXINTERVAL5;      // USB Host Receive Polling Interval
                                    // Endpoint 5
         uint8_t  RESERVED45[2];
    __IO uint16_t TXMAXP6;          // USB Maximum Transmit Data Endpoint 6
    __IO uint8_t  TXCSRL6;          // USB Transmit Control and Status
                                    // Endpoint 6 Low
    __IO uint8_t  TXCSRH6;          // USB Transmit Control and Status
                                    // Endpoint 6 High
    __IO uint16_t RXMAXP6;          // USB Maximum Receive Data Endpoint 6
    __IO uint8_t  RXCSRL6;          // USB Receive Control and Status
                                    // Endpoint 6 Low
    __IO uint8_t  RXCSRH6;          // USB Receive Control and Status
                                    // Endpoint 6 High
    __I  uint16_t RXCOUNT6;         // USB Receive Byte Count Endpoint 6
    __IO uint8_t  TXTYPE6;          // USB Host Transmit Configure Type
                                    // Endpoint 6
    __IO uint8_t  TXINTERVAL6;      // USB Host Transmit Interval Endpoint 6
    __IO uint8_t  RXTYPE6;          // USB Host Configure Receive Type
                                    // Endpoint 6
    __IO uint8_t  RXINTERVAL6;      // USB Host Receive Polling Interval
                                    // Endpoint 6
         uint8_t  RESERVED46[2];
    __IO uint16_t TXMAXP7;          // USB Maximum Transmit Data Endpoint 7
    __IO uint8_t  TXCSRL7;          // USB Transmit Control and Status
                                    // Endpoint 7 Low
    __IO uint8_t  TXCSRH7;          // USB Transmit Control and Status
                                    // Endpoint 7 High
    __IO uint16_t RXMAXP7;          // USB Maximum Receive Data Endpoint 7
    __IO uint8_t  RXCSRL7;          // USB Receive Control and Status
                                    // Endpoint 7 Low
    __IO uint8_t  RXCSRH7;          // USB Receive Control and Status
                                    // Endpoint 7 High
    __I  uint16_t RXCOUNT7;         // USB Receive Byte Count Endpoint 7
    __IO uint8_t  TXTYPE7;          // USB Host Transmit Configure Type
                                    // Endpoint 7
    __IO uint8_t  TXINTERVAL7;      // USB Host Transmit Interval Endpoint 7
    __IO uint8_t  RXTYPE7;          // USB Host Configure Receive Type
                                    // Endpoint 7
    __IO uint8_t  RXINTERVAL7;      // USB Host Receive Polling Interval
                                    // Endpoint 7
         uint8_t  RESERVED47[2];
    __IO uint16_t TXMAXP8;          // USB Maximum Transmit Data Endpoint 8
    __IO uint8_t  TXCSRL8;          // USB Transmit Control and Status
                                    // Endpoint 8 Low
    __IO uint8_t  TXCSRH8;          // USB Transmit Control and Status
                                    // Endpoint 8 High
    __IO uint16_t RXMAXP8;          // USB Maximum Receive Data Endpoint 8
    __IO uint8_t  RXCSRL8;          // USB Receive Control and Status
                                    // Endpoint 8 Low
    __IO uint8_t  RXCSRH8;          // USB Receive Control and Status
                                    // Endpoint 8 High
    __I  uint16_t RXCOUNT8;         // USB Receive Byte Count Endpoint 8
    __IO uint8_t  TXTYPE8;          // USB Host Transmit Configure Type
                                    // Endpoint 8
    __IO uint8_t  TXINTERVAL8;      // USB Host Transmit Interval Endpoint 8
    __IO uint8_t  RXTYPE8;          // USB Host Configure Receive Type
                                    // Endpoint 8
    __IO uint8_t  RXINTERVAL8;      // USB Host Receive Polling Interval
                                    // Endpoint 8
         uint8_t  RESERVED48[2];
    __IO uint16_t TXMAXP9;          // USB Maximum Transmit Data Endpoint 9
    __IO uint8_t  TXCSRL9;          // USB Transmit Control and Status
                                    // Endpoint 9 Low
    __IO uint8_t  TXCSRH9;          // USB Transmit Control and Status
                                    // Endpoint 9 High
    __IO uint16_t RXMAXP9;          // USB Maximum Receive Data Endpoint 9
    __IO uint8_t  RXCSRL9;          // USB Receive Control and Status
                                    // Endpoint 9 Low
    __IO uint8_t  RXCSRH9;          // USB Receive Control and Status
                                    // Endpoint 9 High
    __I  uint16_t RXCOUNT9;         // USB Receive Byte Count Endpoint 9
    __IO uint8_t  TXTYPE9;          // USB Host Transmit Configure Type
                                    // Endpoint 9
    __IO uint8_t  TXINTERVAL9;      // USB Host Transmit Interval Endpoint 9
    __IO uint8_t  RXTYPE9;          // USB Host Configure Receive Type
                                    // Endpoint 9
    __IO uint8_t  RXINTERVAL9;      // USB Host Receive Polling Interval
                                    // Endpoint 9
         uint8_t  RESERVED49[2];
    __IO uint16_t TXMAXP10;         // USB Maximum Transmit Data Endpoint 10
    __IO uint8_t  TXCSRL10;         // USB Transmit Control and Status
                                    // Endpoint 10 Low
