lightelf76/FNET/fnet_stack/port/cpu/lm3s/lm3s_regs.h
    __IO uint8_t  TXCSRH10;         // USB Transmit Control and Status
                                    // Endpoint 10 High
    __IO uint16_t RXMAXP10;         // USB Maximum Receive Data Endpoint 10
    __IO uint8_t  RXCSRL10;         // USB Receive Control and Status
                                    // Endpoint 10 Low
    __IO uint8_t  RXCSRH10;         // USB Receive Control and Status
                                    // Endpoint 10 High
    __I  uint16_t RXCOUNT10;        // USB Receive Byte Count Endpoint 10
    __IO uint8_t  TXTYPE10;         // USB Host Transmit Configure Type
                                    // Endpoint 10
    __IO uint8_t  TXINTERVAL10;     // USB Host Transmit Interval Endpoint 10
    __IO uint8_t  RXTYPE10;         // USB Host Configure Receive Type
                                    // Endpoint 10
    __IO uint8_t  RXINTERVAL10;     // USB Host Receive Polling Interval
                                    // Endpoint 10
         uint8_t  RESERVED50[2];
    __IO uint16_t TXMAXP11;         // USB Maximum Transmit Data Endpoint 11
    __IO uint8_t  TXCSRL11;         // USB Transmit Control and Status
                                    // Endpoint 11 Low
    __IO uint8_t  TXCSRH11;         // USB Transmit Control and Status
                                    // Endpoint 11 High
    __IO uint16_t RXMAXP11;         // USB Maximum Receive Data Endpoint 11
    __IO uint8_t  RXCSRL11;         // USB Receive Control and Status
                                    // Endpoint 11 Low
    __IO uint8_t  RXCSRH11;         // USB Receive Control and Status
                                    // Endpoint 11 High
    __I  uint16_t RXCOUNT11;        // USB Receive Byte Count Endpoint 11
    __IO uint8_t  TXTYPE11;         // USB Host Transmit Configure Type
                                    // Endpoint 11
    __IO uint8_t  TXINTERVAL11;     // USB Host Transmit Interval Endpoint 11
    __IO uint8_t  RXTYPE11;         // USB Host Configure Receive Type
                                    // Endpoint 11
    __IO uint8_t  RXINTERVAL11;     // USB Host Receive Polling Interval
                                    // Endpoint 11
         uint8_t  RESERVED51[2];
    __IO uint16_t TXMAXP12;         // USB Maximum Transmit Data Endpoint 12
    __IO uint8_t  TXCSRL12;         // USB Transmit Control and Status
                                    // Endpoint 12 Low
    __IO uint8_t  TXCSRH12;         // USB Transmit Control and Status
                                    // Endpoint 12 High
    __IO uint16_t RXMAXP12;         // USB Maximum Receive Data Endpoint 12
    __IO uint8_t  RXCSRL12;         // USB Receive Control and Status
                                    // Endpoint 12 Low
    __IO uint8_t  RXCSRH12;         // USB Receive Control and Status
                                    // Endpoint 12 High
    __I  uint16_t RXCOUNT12;        // USB Receive Byte Count Endpoint 12
    __IO uint8_t  TXTYPE12;         // USB Host Transmit Configure Type
                                    // Endpoint 12
    __IO uint8_t  TXINTERVAL12;     // USB Host Transmit Interval Endpoint 12
    __IO uint8_t  RXTYPE12;         // USB Host Configure Receive Type
                                    // Endpoint 12
    __IO uint8_t  RXINTERVAL12;     // USB Host Receive Polling Interval
                                    // Endpoint 12
         uint8_t  RESERVED52[2];
    __IO uint16_t TXMAXP13;         // USB Maximum Transmit Data Endpoint 13
    __IO uint8_t  TXCSRL13;         // USB Transmit Control and Status
                                    // Endpoint 13 Low
    __IO uint8_t  TXCSRH13;         // USB Transmit Control and Status
                                    // Endpoint 13 High
    __IO uint16_t RXMAXP13;         // USB Maximum Receive Data Endpoint 13
    __IO uint8_t  RXCSRL13;         // USB Receive Control and Status
                                    // Endpoint 13 Low
    __IO uint8_t  RXCSRH13;         // USB Receive Control and Status
                                    // Endpoint 13 High
    __I  uint16_t RXCOUNT13;        // USB Receive Byte Count Endpoint 13
    __IO uint8_t  TXTYPE13;         // USB Host Transmit Configure Type
                                    // Endpoint 13
    __IO uint8_t  TXINTERVAL13;     // USB Host Transmit Interval Endpoint 13
    __IO uint8_t  RXTYPE13;         // USB Host Configure Receive Type
                                    // Endpoint 13
    __IO uint8_t  RXINTERVAL13;     // USB Host Receive Polling Interval
                                    // Endpoint 13
         uint8_t  RESERVED53[2];
    __IO uint16_t TXMAXP14;         // USB Maximum Transmit Data Endpoint 14
    __IO uint8_t  TXCSRL14;         // USB Transmit Control and Status
                                    // Endpoint 14 Low
    __IO uint8_t  TXCSRH14;         // USB Transmit Control and Status
                                    // Endpoint 14 High
    __IO uint16_t RXMAXP14;         // USB Maximum Receive Data Endpoint 14
    __IO uint8_t  RXCSRL14;         // USB Receive Control and Status
                                    // Endpoint 14 Low
    __IO uint8_t  RXCSRH14;         // USB Receive Control and Status
                                    // Endpoint 14 High
    __I  uint16_t RXCOUNT14;        // USB Receive Byte Count Endpoint 14
    __IO uint8_t  TXTYPE14;         // USB Host Transmit Configure Type
                                    // Endpoint 14
    __IO uint8_t  TXINTERVAL14;     // USB Host Transmit Interval Endpoint 14
    __IO uint8_t  RXTYPE14;         // USB Host Configure Receive Type
                                    // Endpoint 14
    __IO uint8_t  RXINTERVAL14;     // USB Host Receive Polling Interval
                                    // Endpoint 14
         uint8_t  RESERVED54[2];
    __IO uint16_t TXMAXP15;         // USB Maximum Transmit Data Endpoint 15
    __IO uint8_t  TXCSRL15;         // USB Transmit Control and Status
                                    // Endpoint 15 Low
    __IO uint8_t  TXCSRH15;         // USB Transmit Control and Status
                                    // Endpoint 15 High
    __IO uint16_t RXMAXP15;         // USB Maximum Receive Data Endpoint 15
    __IO uint8_t  RXCSRL15;         // USB Receive Control and Status
                                    // Endpoint 15 Low
    __IO uint8_t  RXCSRH15;         // USB Receive Control and Status
                                    // Endpoint 15 High
    __I  uint16_t RXCOUNT15;        // USB Receive Byte Count Endpoint 15
    __IO uint8_t  TXTYPE15;         // USB Host Transmit Configure Type
                                    // Endpoint 15
    __IO uint8_t  TXINTERVAL15;     // USB Host Transmit Interval Endpoint 15
    __IO uint8_t  RXTYPE15;         // USB Host Configure Receive Type
                                    // Endpoint 15
    __IO uint8_t  RXINTERVAL15;     // USB Host Receive Polling Interval
                                    // Endpoint 15
         uint8_t  RESERVED55[262];
    __IO uint16_t RQPKTCOUNT1;      // USB Request Packet Count in Block
                                    // Transfer Endpoint 1
         uint8_t  RESERVED56[2];
    __IO uint16_t RQPKTCOUNT2;      // USB Request Packet Count in Block
                                    // Transfer Endpoint 2
         uint8_t  RESERVED57[2];
    __IO uint16_t RQPKTCOUNT3;      // USB Request Packet Count in Block
                                    // Transfer Endpoint 3
         uint8_t  RESERVED58[2];
    __IO uint16_t RQPKTCOUNT4;      // USB Request Packet Count in Block
                                    // Transfer Endpoint 4
         uint8_t  RESERVED59[2];
    __IO uint16_t RQPKTCOUNT5;      // USB Request Packet Count in Block
                                    // Transfer Endpoint 5
         uint8_t  RESERVED60[2];
    __IO uint16_t RQPKTCOUNT6;      // USB Request Packet Count in Block
                                    // Transfer Endpoint 6
         uint8_t  RESERVED61[2];
    __IO uint16_t RQPKTCOUNT7;      // USB Request Packet Count in Block
                                    // Transfer Endpoint 7
         uint8_t  RESERVED62[2];
    __IO uint16_t RQPKTCOUNT8;      // USB Request Packet Count in Block
                                    // Transfer Endpoint 8
         uint8_t  RESERVED63[2];
    __IO uint16_t RQPKTCOUNT9;      // USB Request Packet Count in Block
                                    // Transfer Endpoint 9
         uint8_t  RESERVED64[2];
    __IO uint16_t RQPKTCOUNT10;     // USB Request Packet Count in Block
                                    // Transfer Endpoint 10
         uint8_t  RESERVED65[2];
    __IO uint16_t RQPKTCOUNT11;     // USB Request Packet Count in Block
                                    // Transfer Endpoint 11
         uint8_t  RESERVED66[2];
    __IO uint16_t RQPKTCOUNT12;     // USB Request Packet Count in Block
                                    // Transfer Endpoint 12
         uint8_t  RESERVED67[2];
    __IO uint16_t RQPKTCOUNT13;     // USB Request Packet Count in Block
                                    // Transfer Endpoint 13
         uint8_t  RESERVED68[2];
    __IO uint16_t RQPKTCOUNT14;     // USB Request Packet Count in Block
                                    // Transfer Endpoint 14
         uint8_t  RESERVED69[2];
    __IO uint16_t RQPKTCOUNT15;     // USB Request Packet Count in Block
                                    // Transfer Endpoint 15
         uint8_t  RESERVED70[2];
    __IO uint16_t RXDPKTBUFDIS;     // USB Receive Double Packet Buffer Disable
    __IO uint16_t TXDPKTBUFDIS;     // USB Transmit Double Packet Buffer
                                    // Disable
         uint8_t  RESERVED71[188];
    __IO uint32_t EPC;              // USB External Power Control
    __I  uint32_t EPCRIS;           // USB External Power Control Raw Interrupt Status
    __IO uint32_t EPCIM;            // USB External Power Control Interrupt
                                    // Mask
    __IO uint32_t EPCISC;           // USB External Power Control Interrupt
                                    // Status and Clear
    __I  uint32_t DRRIS;            // USB Device Resume Raw Interrupt Status
    __IO uint32_t DRIM;             // USB Device Resume Interrupt Mask
    __O  uint32_t DRISC;            // USB Device Resume Interrupt Status and
                                    // Clear
    __IO uint32_t GPCS;             // USB General-Purpose Control and Status
         uint8_t  RESERVED72[16];
    __IO uint32_t VDC;              // USB VBUS Droop Control
    __I  uint32_t VDCRIS;           // USB VBUS Droop Control Raw Interrupt
                                    // Status
    __IO uint32_t VDCIM;            // USB VBUS Droop Control Interrupt Mask
    __IO uint32_t VDCISC;           // USB VBUS Droop Control Interrupt
                                    // Status and Clear
         uint8_t  RESERVED73[4];
    __I  uint32_t IDVRIS;           // USB ID Valid Detect Raw Interrupt Status
    __IO uint32_t IDVIM;            // USB ID Valid Detect Interrupt Mask
    __IO uint32_t IDVISC;           // USB ID Valid Detect Interrupt
                                    // Status and Clear
    __IO uint32_t DMASEL;           // USB DMA Select
} USB_Type;
// </g>

/*----------       Watchdog Timer (WDT)                           -----------*/
// <g> Watchdog Timer (WDT)
typedef struct
{
    __IO uint32_t LOAD;             // Load register
    __I  uint32_t VALUE;            // Current value register
    __IO uint32_t CTL;              // Control register
    __O  uint32_t ICR;              // Interrupt clear register
    __I  uint32_t RIS;              // Raw interrupt status register
    __I  uint32_t MIS;              // Masked interrupt status register
         uint8_t  RESERVED0[1024];
    __IO uint32_t TEST;             // Test register
         uint8_t  RESERVED1[2020];
    __IO uint32_t LOCK;             // Lock register
} WDT_Type;
// </g>

/******************************************************************************/
/*                              Memory map                                    */
/******************************************************************************/

